{
  "state": "Ohio",
  "stateID": "OH",
  "stateInstitutionName": "Ohio Department of Education",
  "stateStandardName": "Ohio`s Learning Standards and Model Curriculum",
  "stateStandardAbbriv": "OLSMC",
  "URL": "https://education.ohio.gov/Topics/Learning-in-Ohio",
  "grades": [
    {
          "grade": "7",
          "subject": [
            {
              "subjectID": "Math",
              "subjectTitle": "MATHEMATICS",
              "URL": "https://education.ohio.gov/getattachment/Topics/Learning-in-Ohio/Mathematics/Ohio-s-Learning-Standards-in-Mathematics/MATH-Standards-Grade-7.pdf.aspx?lang=en-US",
              "objectives": [
                {
                  "objectiveID": "OH.7.MATH.1",
                  "objectiveTitle": "Ratios and Proportional Relationships",
                  "objectiveDescription": "Analyze proportional relationships and use them to solve real-world and mathematical problems.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Compute unit rates associated with ratios of fractions, including ratios of lengths, areas, and other quantities measured in like or different units."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Recognize and represent proportional relationships between quantities."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Use proportional relationships to solve multistep ratio and percent problems."
                    }
                  ]
                },
                {
                  "objectiveID": "OH.7.MATH.2",
                  "objectiveTitle": "The Number System",
                  "objectiveDescription": "Apply and extend previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Apply and extend previous understandings of addition and subtraction to add and subtract rational numbers; represent addition and subtraction on a horizontal or vertical number line diagram."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Apply and extend previous understandings of multiplication and division and of fractions to multiply and divide rational numbers."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Solve real-world and mathematical problems involving the four operations with rational numbers."
                    }
                  ]
                },
                {
                  "objectiveID": "OH.7.MATH.3",
                  "objectiveTitle": "Expressions and Equations",
                  "objectiveDescription": "Use properties of operations to generate equivalent expressions and solve real-life and mathematical problems using numerical and algebraic expressions and equations.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Apply properties of operations as strategies to add, subtract, factor, and expand linear expressions with rational coefficients."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "In a problem context, understand that rewriting an expression in an equivalent form can reveal and explain properties of the quantities represented by the expression and can reveal how those quantities are related."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Solve multi-step real-life and mathematical problems posed with positive and negative rational numbers in any form (whole numbers, fractions, and decimals), using tools strategically."
                    },
                    {
                      "expectationID": "4",
                      "expectationDescription": "Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problems by reasoning about the quantities."
                    }
                  ]
                },
                {
                  "objectiveID": "OH.7.MATH.4",
                  "objectiveTitle": "Geometry",
                  "objectiveDescription": "Draw, construct, and describe geometrical figures and describe the relationships between them.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Solve problems involving similar figures with right triangles, other triangles, and special quadrilaterals."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Draw geometric figures with given conditions."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Describe the two-dimensional figures that result from slicing three-dimensional figures."
                    },
                    {
                      "expectationID": "4",
                      "expectationDescription": "Work with circles."
                    },
                    {
                      "expectationID": "5",
                      "expectationDescription": "Use facts about supplementary, complementary, vertical, and adjacent angles in a multi-step problem to write and solve simple equations for an unknown angle in a figure."
                    },
                    {
                      "expectationID": "6",
                      "expectationDescription": "Solve real-world and mathematical problems involving area, volume, and surface area of two- and three-dimensional objects."
                    }
                  ]
                },
                {
                  "objectiveID": "OH.7.MATH.5",
                  "objectiveTitle": "Statistics and Probability",
                  "objectiveDescription": "Use sampling to draw conclusions about a population and broaden understanding of statistical problem solving.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Understand that statistics can be used to gain information about a population by examining a sample of the population."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Broaden statistical reasoning by using the GAISE model."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Describe and analyze distributions."
                    },
                    {
                      "expectationID": "4",
                      "expectationDescription": "Understand that the probability of a chance event is a number between 0 and 1 that expresses the likelihood of the event occurring."
                    },
                    {
                      "expectationID": "5",
                      "expectationDescription": "Approximate the probability of a chance event by collecting data on the chance process that produces it and observing its long-run relative frequency, and predict the approximate relative frequency given the probability."
                    },
                    {
                      "expectationID": "6",
                      "expectationDescription": "Develop a probability model and use it to find probabilities of events."
                    },
                    {
                      "expectationID": "7",
                      "expectationDescription": "Find probabilities of compound events using organized lists, tables, tree diagrams, and simulations."
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }