{
  "state": "Ohio",
  "stateID": "OH",
  "stateInstitutionName": "Ohio Department of Education",
  "stateStandardName": "Ohio`s Learning Standards and Model Curriculum",
  "stateStandardAbbriv": "OLSMC",
  "URL": "https://education.ohio.gov/Topics/Learning-in-Ohio",
  "grades": [
    {
          "grade": "8",
          "subject": [
            {
              "subjectID": "Math",
              "subjectTitle": "MATHEMATICS",
              "URL": "https://education.ohio.gov/getattachment/Topics/Learning-in-Ohio/Mathematics/Ohio-s-Learning-Standards-in-Mathematics/MATH-Standards-Grade-8.pdf.aspx?lang=en-US",
              "objectives": [
                {
                  "objectiveID": "OH.8.MATH.1",
                  "objectiveTitle": "The Number System",
                  "objectiveDescription": "Know that there are numbers that are not rational, and approximate them by rational numbers.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Know that real numbers are either rational or irrational. Understand informally that every number has a decimal expansion which is repeating, terminating, or is non-repeating and non-terminating."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Use rational approximations of irrational numbers to compare the size of irrational numbers, locate them approximately on a number line diagram, and estimate the value of expressions."
                    }
                  ]
                },
                {
                  "objectiveID": "OH.8.MATH.2",
                  "objectiveTitle": "Expressions and Equations",
                  "objectiveDescription": "Work with radicals and integer exponents.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Understand, explain, and apply the properties of integer exponents to generate equivalent numerical expressions."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Use square root and cube root symbols to represent solutions to equations of the form x² = p and x³ = p, where p is a positive rational number."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Use numbers expressed in the form of a single digit times an integer power of 10 to estimate very large or very small quantities and to express how many times as much one is than the other."
                    },
                    {
                      "expectationID": "4",
                      "expectationDescription": "Perform operations with numbers expressed in scientific notation, including problems where both decimal notation and scientific notation are used."
                    },
                    {
                      "expectationID": "5",
                      "expectationDescription": "Interpret scientific notation that has been generated by technology."
                    },
                    {
                      "expectationID": "6",
                      "expectationDescription": "Understand the connections between proportional relationships, lines, and linear equations."
                    },
                    {
                      "expectationID": "7",
                      "expectationDescription": "Analyze and solve linear equations and pairs of simultaneous linear equations."
                    }
                  ]
                },
                {
                  "objectiveID": "OH.8.MATH.3",
                  "objectiveTitle": "Functions",
                  "objectiveDescription": "Define, evaluate, and compare functions.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Understand that a function is a rule that assigns to each input exactly one output."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Compare properties of two functions each represented in a different way."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Interpret the equation y = mx + b as defining a linear function, whose graph is a straight line."
                    },
                    {
                      "expectationID": "4",
                      "expectationDescription": "Construct a function to model a linear relationship between two quantities."
                    },
                    {
                      "expectationID": "5",
                      "expectationDescription": "Describe qualitatively the functional relationship between two quantities by analyzing a graph."
                    }
                  ]
                },
                {
                  "objectiveID": "OH.8.MATH.4",
                  "objectiveTitle": "Geometry",
                  "objectiveDescription": "Understand congruence and similarity using physical models, transparencies, or geometry software.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Verify experimentally the properties of rotations, reflections, and translations."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Understand that a two-dimensional figure is congruent to another if the second can be obtained from the first by a sequence of rotations, reflections, and translations."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Describe the effect of dilations, translations, rotations, and reflections on two-dimensional figures using coordinates."
                    },
                    {
                      "expectationID": "4",
                      "expectationDescription": "Understand that a two-dimensional figure is similar to another if the second can be obtained from the first by a sequence of rotations, reflections, translations, and dilations."
                    },
                    {
                      "expectationID": "5",
                      "expectationDescription": "Use informal arguments to establish facts about the angle sum and exterior angle of triangles, about the angles created when parallel lines are cut by a transversal, and the angle-angle criterion for similarity of triangles."
                    },
                    {
                      "expectationID": "6",
                      "expectationDescription": "Understand and apply the Pythagorean Theorem."
                    },
                    {
                      "expectationID": "7",
                      "expectationDescription": "Solve real-world and mathematical problems involving volume of cylinders, cones, and spheres."
                    }
                  ]
                },
                {
                  "objectiveID": "OH.8.MATH.5",
                  "objectiveTitle": "Statistics and Probability",
                  "objectiveDescription": "Investigate patterns of association in bivariate data.",
                  "expectations": [
                    {
                      "expectationID": "1",
                      "expectationDescription": "Construct and interpret scatter plots for bivariate measurement data to investigate patterns of association between two quantities."
                    },
                    {
                      "expectationID": "2",
                      "expectationDescription": "Understand that straight lines are widely used to model relationships between two quantitative variables."
                    },
                    {
                      "expectationID": "3",
                      "expectationDescription": "Use the equation of a linear model to solve problems in the context of bivariate measurement data, interpreting the slope and intercept."
                    },
                    {
                      "expectationID": "4",
                      "expectationDescription": "Understand that patterns of association can also be seen in bivariate categorical data by displaying frequencies and relative frequencies in a two-way table."
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }